/*
SQLyog Ultimate v12.08 (64 bit)
MySQL - 5.7.26 : Database - secondhand_shop
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`secondhand_shop` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `secondhand_shop`;

/*Table structure for table `cart` */

DROP TABLE IF EXISTS `cart`;

CREATE TABLE `cart` (
  `cartId` int(11) NOT NULL AUTO_INCREMENT COMMENT '编号',
  `comId` int(11) NOT NULL COMMENT '商品编号',
  `comName` varchar(255) NOT NULL COMMENT '商品名称',
  `originalPrice` double NOT NULL COMMENT '商品原价',
  `comprice` double NOT NULL COMMENT '商品现价',
  `comNum` int(11) NOT NULL COMMENT '商品数量',
  `comImg` varchar(255) NOT NULL COMMENT '商品图片',
  `userId` int(11) NOT NULL COMMENT '用户编号',
  PRIMARY KEY (`cartId`),
  KEY `fk_cart_user` (`userId`),
  CONSTRAINT `fk_cart_user` FOREIGN KEY (`userId`) REFERENCES `user` (`userId`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;

/*Data for the table `cart` */

insert  into `cart`(`cartId`,`comId`,`comName`,`originalPrice`,`comprice`,`comNum`,`comImg`,`userId`) values (6,2,'苹果11苹果x智能手机高清摄像畅玩游戏全新未拆封全',18.8,18.8,1,'\\secondhand_shop\\upload\\201912051632236013406.jpg',7),(7,3,'华为mate8 4+128 全网通',750,3988,1,'\\secondhand_shop\\upload\\201912051635217663413.jpg',7),(9,4,'Iphone 6 puls 16g 全原装',222,6600,1,'\\secondhand_shop\\upload\\201912051644091563208.jpg',9),(13,14,'娇韵诗全明星眼霜15ml紧致眼霜淡化细纹黑眼圈',220,220,1,'\\secondhand_shop\\upload\\201912071215183836884.jpg',28);

/*Table structure for table `collect` */

DROP TABLE IF EXISTS `collect`;

CREATE TABLE `collect` (
  `collectId` int(11) NOT NULL AUTO_INCREMENT COMMENT '编号',
  `comId` int(11) NOT NULL COMMENT '商品编号',
  `comName` varchar(255) NOT NULL COMMENT '商品名称',
  `userId` int(11) NOT NULL COMMENT '用户编号',
  `comPrice` double NOT NULL COMMENT '商品价格',
  `comImg` varchar(255) NOT NULL COMMENT '商品图片',
  PRIMARY KEY (`collectId`),
  KEY `fk_col_userId` (`userId`),
  KEY `fk_col_comId` (`comId`),
  CONSTRAINT `fk_col_comId` FOREIGN KEY (`comId`) REFERENCES `commodity` (`commodityId`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_col_userId` FOREIGN KEY (`userId`) REFERENCES `user` (`userId`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=26 DEFAULT CHARSET=utf8;

/*Data for the table `collect` */

insert  into `collect`(`collectId`,`comId`,`comName`,`userId`,`comPrice`,`comImg`) values (16,5,'全新未激活iphone6s32g全网通4g',2,698,'\\secondhand_shop\\upload\\201912051647249488330.jpg'),(17,3,'华为mate8 4+128 全网通',7,3988,'\\secondhand_shop\\upload\\201912051635217663413.jpg'),(18,3,'华为mate8 4+128 全网通',3,3988,'\\secondhand_shop\\upload\\201912051635217663413.jpg'),(19,17,'迪奥999口红 哑光999 滋润999 全新正品带',2,60,'\\secondhand_shop\\upload\\201912071231124376421.jpg'),(20,3,'华为mate8 4+128 全网通',2,3988,'\\secondhand_shop\\upload\\201912051635217663413.jpg'),(21,14,'娇韵诗全明星眼霜15ml紧致眼霜淡化细纹黑眼圈',3,220,'\\secondhand_shop\\upload\\201912071215183836884.jpg'),(22,5,'全新未激活iphone6s32g全网通4g',26,698,'\\secondhand_shop\\upload\\201912051647249488330.jpg'),(23,21,'苹果8代iPhone8 64G 金色',2,1288,'\\secondhand_shop\\upload\\201912081240043653673.jpg'),(24,14,'娇韵诗全明星眼霜15ml紧致眼霜淡化细纹黑眼圈',2,220,'\\secondhand_shop\\upload\\201912071215183836884.jpg'),(25,14,'娇韵诗全明星眼霜15ml紧致眼霜淡化细纹黑眼圈',28,220,'\\secondhand_shop\\upload\\201912071215183836884.jpg');

/*Table structure for table `commodity` */

DROP TABLE IF EXISTS `commodity`;

CREATE TABLE `commodity` (
  `commodityId` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品编号',
  `commodityName` varchar(255) NOT NULL COMMENT '商品名称',
  `commodityPrice` double NOT NULL COMMENT '商品价格',
  `commodityViewcount` int(11) DEFAULT '0' COMMENT '商品浏览次数',
  `commodityShowimg` varchar(255) NOT NULL COMMENT '商品缩略图',
  `originalCos` double DEFAULT NULL COMMENT '商品原价',
  `commodityCondition` varchar(255) NOT NULL COMMENT '商品成色',
  `commodityArea` varchar(255) NOT NULL COMMENT '所在地',
  `commodityMaster` int(11) NOT NULL COMMENT '主人编号',
  `commodityIntroduce` varchar(1000) DEFAULT NULL COMMENT '商品介绍',
  `commodityClid` int(11) NOT NULL COMMENT '商品分类编号',
  `commodityState` int(11) NOT NULL DEFAULT '1' COMMENT '商品状态编号',
  `commodityDate` datetime NOT NULL COMMENT '商品发布时间',
  `commodityClassify` int(11) NOT NULL DEFAULT '1' COMMENT '商品库存',
  PRIMARY KEY (`commodityId`),
  KEY `fk_com_class` (`commodityClid`),
  KEY `fk_com_stat` (`commodityState`),
  KEY `fk_com_imgs` (`commodityShowimg`),
  KEY `fk_com_user` (`commodityMaster`),
  CONSTRAINT `fk_com_class` FOREIGN KEY (`commodityClid`) REFERENCES `commodity_classify` (`classifyId`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_com_stat` FOREIGN KEY (`commodityState`) REFERENCES `commodity_state` (`comStid`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_com_user` FOREIGN KEY (`commodityMaster`) REFERENCES `user` (`userId`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=35 DEFAULT CHARSET=utf8;

/*Data for the table `commodity` */

insert  into `commodity`(`commodityId`,`commodityName`,`commodityPrice`,`commodityViewcount`,`commodityShowimg`,`originalCos`,`commodityCondition`,`commodityArea`,`commodityMaster`,`commodityIntroduce`,`commodityClid`,`commodityState`,`commodityDate`,`commodityClassify`) values (2,'苹果11苹果x智能手机高清摄像畅玩游戏全新未拆封全',18.8,0,'201912051632236013406.jpg',18.8,'全新','广东深圳 罗湖区',2,'网通 免 1免费送！苹果x智能手机高清摄像畅玩游戏全新未拆封全网通 免费送机械师笔记本电脑外星人ipad5免费送无套路 免费领取苹果8苹果X plus 华为p30 荣耀 vivox20 oppo 小米9手机 索尼佳能微单 外星人笔记本 ipad平板等更多产品活动请看其他宝贝！本电商公司庆典活动促销！为增加人气，增加销量！活动还有最后几天时间！毕竟公司不可能一直亏本做下去，望理解！奖品包含:苹果华为vivo小米手机|外星人笔记本|ipad平板|小爱同学|天猫精灵|蓝牙音响|耳机|相机|充电宝|小米平衡车| 3C数码配件数据线耳机等电子产品仓库随机发送一款包裹不指定活动最后三天！三天后全部恢复原价！！！再不下手就晚了！活动最后三天！三天后全部恢复原价！！！再不下手就晚了！活动最后三天！三天后全部恢复原价！！！再不下手就晚了！点赞+收藏 ！完成以上步骤才能免费领取！以上步骤完成后直接下单购买支付邮费即可！本交易仅支持邮寄本交易仅支持邮寄',3,6,'2019-12-05 16:33:56',1),(3,'华为mate8 4+128 全网通',3988,0,'201912051635217663413.jpg',750,'非全新','广东深圳 福田区',2,'华为mate8 4+128 全网通 全网通 双卡双待 移动联通电信可4g 带指纹功能 转手原因:换了新款了 这个没问题打算卖掉 入手渠道:专卖店买的 使用感受:功能一切正常 运行流畅 大型游戏不卡顿',3,6,'2019-12-05 16:36:36',1),(4,'Iphone 6 puls 16g 全原装',6600,0,'201912051644091563208.jpg',222,'非全新','山东青岛 市北区',2,'感兴趣的话给我留言吧！',3,3,'2019-12-05 16:45:21',1),(5,'全新未激活iphone6s32g全网通4g',698,0,'201912051647249488330.jpg',5888,'非全新','北京北京 密云区',2,'全新未激活6s 32g新机膜都没有撕 支持移动联通电信全部4g 移动联通tmsi解锁 电信完美解锁 赠送卡贴会发送解锁视频简单易懂 全部机器都支持闲鱼官方验机服务 机器不原装 功能有瑕疵立马退货 退货邮费由我出！ 机器随便升级还原，随意换卡，没有电池方便外观方面的担忧，利润微薄，不接受还价！ 有一些特价机运输过程中有一些磕碰，特价699！全新未激活750！购机须知 1.全部机器不接受还价，如果想还价就准备好打包！2.所有机器全部支持闲鱼官方验机，平台验机邮费由买家自理！3.所有机器都是现货，随时可拍视频！4.机器送全自动卡贴，有任何疑问随时找我！5.机器送非原装配件，没有耳机！6.所有机器不包邮，默认黑色，快递默认顺丰，顺丰不到发EMS！',3,3,'2019-12-05 16:55:40',1),(6,'华为荣耀8全网通4+64g/32g3+32g移动联通电信二手',2000,0,'201912051700552435465.jpg',386,'非全新','广东广州 荔湾区',2,'手机9成新：外观小磕碰小划痕， 全网通3+32G，386元， 全网通4+32g，427元， 全网通4+64g，447元，95新，划痕很少，整体很新，价格贵30元，●尺寸：5.2英寸●电池：3000毫安●CPU：八核，海思麒麟950●摄像头：后置双摄1200万 +前置800万●配件：充电器，数据线，手机套，●全网通，支持移动联通电信4g网络●NFC功能，红外功能，应用分身，指纹解锁灵敏，运行流畅，可玩王者吃鸡，●恢复出厂设置，无账号，●价格可协商，收货后七天内有问题，可退货退款，两个月保修，',3,6,'2019-12-05 17:03:05',1),(7,'苹果二代蓝牙耳机',499,0,'201912051706373909627.jpg',499,'全新','香港九龙 九龙城区',2,'转手原因，之前结婚的时候买来送姐妹团的，预算中多出3台，自己留了一台， 剩两台一直放着没用，就打算低价转出，需要的可以联系！需要可以联系哦本交易仅支持邮寄 有不便请谅解',2,3,'2019-12-05 17:07:23',1),(8,'全新成色苹果6代32g/iphone6支持验机',1888,0,'201912051709208108103.jpg',450,'全新','天津天津 河西区',2,'18年产苹果6在保32g全新成色支持验机 18年产全新成色苹果iphone6代32g支持验机 苹果6 32g美版 支持移动2g联通4g电信4g，全原装成色靓，有金色，深灰色两个颜色，配合卡贴，提前设置好，插卡就用！电池都高，基本都是97以上，很多在保机，没有老化什么的！全部机器都支持平台验机，一个螺丝不原装，功能有任何瑕疵，立马退款！退货邮费我出！个别机器有小划痕磕碰特价450 99新499，提前设置好，到手插卡就用！不用您麻烦！备用机首选！购机须知1.全部机器不还价，利润微薄，觉得价格高您再找找！2.所有机器都支持平台验机，一个螺丝不原装都可以退货，不原装退货邮费我出！3.所有机器都是现货，可以随时拍视频，看爱思助手，满足所有需要！4.机器送卡贴，提前设置好，买家到手插卡就用，有任何问题随时在线！5.所有商品不包邮，不包邮！送配件，没有耳机！',3,3,'2019-12-05 17:10:58',1),(9,'阿玛尼唇釉新款口红烂番茄色405 204 400',56,0,'201912071122433745492.jpg',299,'全新','浙江杭州 上城区',3,'转手原因：怀孕了，为了宝宝的健康，化妆品都不用了，年头跟我老公去香港买到两支，还有一支是我生日闺蜜送我的，一共三支低价出了！！！全新的！！我去心心鉴定过了，正品，支持你去坚定的，假了包退，可以直接拍下，点我想要联系我！',4,3,'2019-12-07 11:24:07',1),(10,'tf口红 16号黑管 tf15.tf80',72,0,'201912071127400994969.jpg',288,'全新','香港香港岛 中西区',3,'全新正品带小票，正装非小样。有任何疑虑绝对支持专柜查看，只认准正规专柜查看！TF色号:08#09# 15# 16# 80# （有礼盒，需要请联系） （有礼盒，需要请联系）年头公司入手剩余的存货，低价转让。不议价不议价保真，疑心重的勿扰，事多问题多的请绕道，平时比较忙，不想做多余的解释，用嘴上的，不开玩笑，送人自用都是可以。清完即下架！所有物品出自香港免税店，绝对保真，绝对放心。绝对支持专柜验货哒！只支持正品专柜验货！不支持所谓的网络鉴定，张嘴就来一点也不权威。这么低价的原因是迫不得已清库存。退货请注意，用过的，膏体和外观损坏的恕不退换，请相互理解！（图片都是自己实拍图）\r\n',4,6,'2019-12-07 11:29:27',1),(11,'Fenty Beauty 蕾哈娜 雾面哑光定妆散粉 色号LA',140,0,'201912071134494366165.jpg',299,'全新','香港香港岛 中西区',3,'VENDER#薰衣草全新的超大28g的免税店买的，之前看盒子好看还有优惠就买了，家里的纪梵希都没用完，这个还是出了， 有喜欢的小仙女私我吧',4,6,'2019-12-07 11:35:33',1),(12,'乳香美版，美版看好直接拍精油275元',275,0,'201912071136513819267.jpg',399,'非全新','河北保定 涞水县',3,'感兴趣的话给我留言吧！',4,3,'2019-12-07 11:37:11',1),(13,'美国MD洗面奶207ml',75,0,'201912071138519482345.jpg',158,'全新','上海上海 黄浦区',3,'性价比最高的洗面奶全新一瓶 出去旅游买了2瓶 我现在正在用着一瓶 打算用没换瓶其他的保证正品的哦 不议价',4,3,'2019-12-07 11:39:03',1),(14,'娇韵诗全明星眼霜15ml紧致眼霜淡化细纹黑眼圈',220,0,'201912071215183836884.jpg',220,'全新','香港香港岛 中西区',3,'购于香港免税店，全新未拆',4,3,'2019-12-07 12:18:11',1),(15,'悦诗风吟新版五件套）专柜?悦诗风吟五件套新版内含：爽肤水20',55,0,'201912071220198741546.jpg',168,'全新','广东广州 白云区',3,'0ml �7�7 乳液160ml �7�7 面霜50ml �7�7（赠品：爽肤水15ml，乳液15ml）绿茶系列是悦诗的王牌，味道清新，不刺激，吸收快，主要是 清爽！补水没负担，不厚重!自然生态技术，无色素，无酒精，无任何添加物，没有任何化学成分，ECO认证！纯绿色植物精华！\r\n',4,3,'2019-12-07 12:21:08',1),(16,'海蓝之谜 海蓝之谜焕肤爽肤水',268.8,0,'201912071222249869739.jpg',399,'全新','香港新界 沙田区',3,'含量：100ml，适合任何肤质，不贵好用！正品全新 留有小票，有任何疑虑绝对支持专柜查看。转手原因：因工作方面有调动，需搬到另外一个城市，东西太多 带不了。所以出一部分 自己亲自带回的，保真 。疑心重的勿扰！！平时比较忙，不想做多余的解释。用脸上的 不开玩笑，送人自用都是可以的 日期新鲜！所剩无几，手慢无！看中喜欢的来 非诚勿扰！谢谢！这么低价的原因是迫不得已 清库存本次交易仅支持邮寄#本次交易仅支持邮寄#本次交易仅支持邮寄#',4,6,'2019-12-07 12:23:02',1),(17,'迪奥999口红 哑光999 滋润999 全新正品带',60,0,'201912071231124376421.jpg',199,'全新','香港新界 元朗区',3,'迪奥口红哑光999 滋润999 正装全新正品带小票，支持扫码！有任何疑虑绝对支持专柜查看，只认准正规专柜查看！之前做美妆代购剩余的存货，低价转让。保真，疑心重的勿扰，平时比较忙，不想做多余的解释，用脸上的，不开玩笑，送人自用都是可以的日期还有两年过期。清完即下架！自己住在香港(发货地在香港发出)所有物品出自香港免税店，绝对保证是，绝对放心。绝对支持专柜验货哒！只支持正品专柜验货！不支持所谓的网络鉴定，一点也不权威。这么低价的原因是迫不得已清库存。（图片都是自己实拍图）本交易仅支持邮寄本交易仅支持自提、当面交易、邮寄',4,3,'2019-12-07 12:32:09',1),(18,'无印良品平衡高保湿化妆水',129,0,'201912071237588451431.jpg',60,'非全新','江苏苏州 苏州工业园区',3,'实体专卖店购入，换护肤品转闲置。用了50ml，还剩150ml2020年6月12到期包邮，除偏远。不退换，不议价',4,3,'2019-12-07 12:38:44',1),(19,'苹果7美版iPhone7全网通32G',938,0,'201912081219449736223.jpg',5500,'非全新','四川成都 邛崃市',2,'美版A1778，支持三网4G，插卡即用，同国行，无区别。所有数据已经抹除，到手插卡即用。手机成色还不错，玫瑰金色，具体细节如下图，电池还挺耐用。屏幕仅在黑色背景下有轻微彩光。无任何影响，触摸灵敏，拍照清晰，无暗病。所有功能全部正常使用送数据线，手机壳，钢化膜',3,3,'2019-12-08 12:20:59',1),(20,'OPPO A59m（3GB+32GB) 全网通 八核 金色',329,0,'201912081223222474801.jpg',1999,'非全新','广东广州 越秀区',2,'双卡双待 移动联通电信4G手机CPU：联发科 MT6750后置：1300万像素前置：800万像素内存：3GB储存容量：32GB电池：3075mAh屏幕：5.5英寸分辨率：1280x720像素待机模式：双卡多模极致美颜，手势体感，正面指纹识别，2.5D弧面玻璃情况说明:一直都当备用机使，手机九五成新吧，背面有局部磕碰不影响使用，屏幕已贴钢化膜。其他情况说明：1、单手机，箱子、发票等早已丢失、配非原装手机充电器一只，数据充电线一条再送蓝光护眼钢化膜一张；2、二十四小时收到手机有任何不满意的地方，均可退回，但要求买家承担来回运费；PS：本人芝麻信用分777分，信用极好，在闲鱼售出过203件宝贝，无一差评！交易诚信为本，有一说一，绝对不打虚假广告，有兴趣的朋友可以点击右下角的【我想要】，我看到消息后会在第一时间回复，谢谢~',3,3,'2019-12-08 12:24:37',1),(21,'苹果8代iPhone8 64G 金色',1288,0,'201912081240043653673.jpg',5999,'非全新','四川成都 邛崃市',2,'日版三网4G/配卡贴使用，网络信号与国行一样，成色很好、带壳使用的、保护很好。全原无修，机况完美，到手即可使用，所有数据已经还原，指纹灵敏、拍照清晰。完美运行各类大型游戏，秒杀安卓机。送数据线/手机壳/钢化膜',3,3,'2019-12-08 12:41:17',1),(26,'苹果手机原装耳机',79,0,'201912091823054077790.jpg',120,'全新','河北秦皇岛 海港区',2,'苹果耳机 苹果耳机原装正品iphoneX，苹果通用 ，全新闲置一套全原装，收到包裹可以随便鉴定，都有序列号的。数据线26元，数据线+头49元，耳机79元，一起拍129元支持验货签收，^_^本交易仅支持自提、当面交易、邮寄',2,3,'2019-12-09 18:24:57',1),(27,'魅族mx4高配32g能玩王者！2+16g移动联通双网4G手机',139,0,'201912100905542519234.jpg',999,'非全新','广东广州 番禺区',2,'之前跟闺蜜搞游戏陪练，现在没搞了有一堆手机电脑要处理魅族mx4高配版 / 移动联通4G /2g运行32/16g内存 / 8核 / 能王者 /5.36寸屏幕 / 85成新 /正常使用没毛病 / 账号已退 /16g：13932g：169有质量问题包退啦要就赶紧别墨迹啦啦啦本交易仅支持邮寄本交易仅支持邮寄\r\n',3,3,'2019-12-10 09:07:11',1),(28,'11',11,0,'201912101058330296987.jpg',1111,'8成新','江西 南昌',26,'测试',2,3,'2019-12-10 10:58:52',1),(29,'华为mate8 全网通 4+64g 高配版 全原装无拆修好机',560,0,'201912111538132481670.jpg',2999,'非全新','广东深圳 大鹏新区',2,'功能都正常使用，双卡双待，支持指纹解锁，6寸超大屏幕，运行4g，内存64g，4000毫安电池，大型游戏不卡顿，买回去插卡即用。想要的朋友可以马上带走',3,3,'2019-12-11 15:39:50',1),(30,'nathome/北欧欧慕 NDG01 旅行折叠电煮锅分体锅',259,0,'201912131323369542436.jpg',149,'非全新','重庆重庆 渝北区',8,'athome/北欧欧慕 NDG01折叠水壶旅行电热水壶迷你便携式分体锅品牌北欧姆慕，公司内部拿的展示机，全新机，原价259，携带超级方便，适合出差，旅游三个颜色都有，保证正品，假一赔十，假一赔十！！此水壶除质量问题包退换修外，不支持退货本交易仅支持自提、当面交易、邮寄\r\n',1,3,'2019-12-13 13:24:23',1),(31,'净水器反渗透净水器家用厨房直饮净水机智能纯水机ro反渗透净水',499,0,'201912131327194367484.jpg',899,'全新','北京北京 东城区',8,'【智能除垢-亏本冲量先到先得】【现在购买即送8重好礼】①安装一体式三通阀门②安装防水生料带③自来水余氯检测测试液④加长2分PE管5米⑤豪华三叉不锈钢净水龙头一个⑥胶塞螺丝套装⑦水质测试笔⑧无忧购物保障.【499包邮出，不满意包退货，退货包邮！！亏本冲量,先到先得，请拿一千多的产品跟我们比！！直接拍下就发货】',1,3,'2019-12-13 13:28:27',1),(32,'AI智能蓝牙音箱mini语音声控控制小钢炮无线音箱户外跑步运',29,0,'201912131330162583337.jpg',79,'全新','江西赣州 信丰县',8,'连接方式蓝牙连接有无显示屏:不带屏幕A蓝牙语音音箱【随身版】:1.内置5W大功率喇叭迷你娇小的身材;2.5.0的蓝牙连接3.内置麦克风只需按底部语音按钮,可随时随地远离手机免提通话。4方便小孩远离手机,保护视力,提升小孩学习的法宝;5裸机重量为58克左右仅鸡蛋的大小;蓝牙接受距离为6米左右6收到商品需要扫码注册,语音系统为百度系统不是小爱看清楚再下单简洁方便!如有疑问可咨询闲鱼的在线客服A智能蓝牙音箱随身版小巧便携丨一键唤醒动听音质丨智能通话人工智能音箱时代A随身助手未来张口即来“我是你的智能语音助手”可以为您播放音乐、新闻、查询天气、讲故事、语音下单我正在学习更多新技能,现在试试对说“来首热门歌曲”时间天气新闻百科翻译音乐事育儿数学计算诗歌成语历史蓝牙生活 是音箱,也是智能电话 顶部声纹出声孔,高音清亮,低音浑厚,身临其境。你可以通过音箱接拨联系人手机,同亲人或手游好友语音畅聊。喜欢的宝宝可以直接拍下哦',1,3,'2019-12-13 13:31:27',1),(33,'全新美的电热水壶',58,0,'201912131334324029087.jpg',128,'全新','江西南昌 安义县',8,'美的电热水壶家用不锈钢防烫电水壶大容量烧水壶自动断电开水壶58全新包邮，要的直接拍，数量不多，亏本清仓',1,3,'2019-12-13 13:35:18',1),(34,'11',100,0,'201912131624104241734.jpg',100,'全新','江西 南昌',28,'111',1,3,'2019-12-13 16:24:22',1);

/*Table structure for table `commodity_classify` */

DROP TABLE IF EXISTS `commodity_classify`;

CREATE TABLE `commodity_classify` (
  `classifyId` int(11) NOT NULL AUTO_INCREMENT COMMENT '分类编号',
  `classifyName` varchar(255) NOT NULL COMMENT '分类名称',
  PRIMARY KEY (`classifyId`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

/*Data for the table `commodity_classify` */

insert  into `commodity_classify`(`classifyId`,`classifyName`) values (1,'家电'),(2,'数码'),(3,'手机'),(4,'美妆'),(5,'食品'),(6,'服饰'),(7,'潮鞋');

/*Table structure for table `commodity_state` */

DROP TABLE IF EXISTS `commodity_state`;

CREATE TABLE `commodity_state` (
  `comStid` int(11) NOT NULL AUTO_INCREMENT COMMENT '状态编号',
  `comStname` varchar(25) NOT NULL COMMENT '状态名称',
  PRIMARY KEY (`comStid`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

/*Data for the table `commodity_state` */

insert  into `commodity_state`(`comStid`,`comStname`) values (1,'未审核'),(2,'拒绝上架'),(3,'上架中'),(4,'已下架'),(5,'封禁'),(6,'已出售');

/*Table structure for table `message` */

DROP TABLE IF EXISTS `message`;

CREATE TABLE `message` (
  `messageId` int(11) NOT NULL AUTO_INCREMENT COMMENT '消息编号',
  `userId` int(11) NOT NULL COMMENT '用户编号',
  `messageName` varchar(255) NOT NULL COMMENT '消息名称',
  `content` varchar(1000) NOT NULL COMMENT '消息内容',
  `messageStatus` varchar(10) NOT NULL DEFAULT '未读' COMMENT '消息状态',
  `messageTime` datetime NOT NULL COMMENT '消息时间',
  `addresser` int(11) NOT NULL COMMENT '发件人编号',
  PRIMARY KEY (`messageId`),
  KEY `fk_mes_user` (`userId`)
) ENGINE=MyISAM AUTO_INCREMENT=135 DEFAULT CHARSET=utf8;

/*Data for the table `message` */

insert  into `message`(`messageId`,`userId`,`messageName`,`content`,`messageStatus`,`messageTime`,`addresser`) values (49,4,'系统消息','您的商品松下电吹风EH-NE61，全新闲置转手，江浙沪包邮通过审核!','已读','2019-12-08 14:36:11',1),(48,4,'系统消息','您的商品艾美特取暖器通过审核!','已读','2019-12-08 14:36:06',1),(133,3,'系统提醒','123123已成功购买您的商品《海蓝之谜 海蓝之谜焕肤爽肤水》,请您尽快发货!','未读','2019-12-13 16:27:13',1),(120,8,'系统消息','您的商品AI智能蓝牙音箱mini语音声控控制小钢炮无线音箱户外跑步运通过审核!','未读','2019-12-13 13:31:52',1),(119,8,'系统消息','您的商品净水器反渗透净水器家用厨房直饮净水机智能纯水机ro反渗透净水通过审核!','未读','2019-12-13 13:31:47',1),(118,8,'系统消息','您的商品nathome/北欧欧慕 NDG01 旅行折叠电煮锅分体锅通过审核!','未读','2019-12-13 13:27:09',1),(111,3,'系统提醒','订单号为:as201912130916438947969已发出退款申请,退款原因:商家拒不发货退款理由:测试','未读','2019-12-13 10:30:24',1),(112,1,'退款申请','订单号为:as201912130916438947969发出退款申请,退款原因:商家拒不发货退款理由:测试','未读','2019-12-13 10:30:24',1),(113,3,'系统提醒','123123已成功购买您的商品《Fenty Beauty 蕾哈娜 雾面哑光定妆散粉 色号LA》,请您尽快发货!','未读','2019-12-13 11:14:23',1),(132,2,'系统提醒','123123已成功购买您的商品《华为荣耀8全网通4+64g/32g3+32g移动联通电信二手》,请您尽快发货!','未读','2019-12-13 16:27:13',1),(131,3,'系统消息','您的商品阿玛尼唇釉新款口红烂番茄色405 204 400通过审核!','未读','2019-12-13 16:25:52',1),(130,3,'系统消息','您的商品阿玛尼唇釉新款口红烂番茄色405 204 400已经进入反审阶段!','未读','2019-12-13 16:25:45',1),(129,28,'系统消息','您的商品11通过审核!','未读','2019-12-13 16:24:36',1),(128,1,'申请注入商家','用户编号为:28的用户,用户名为:sjks申请注册为商家','已读','2019-12-13 16:22:58',28),(127,1,'退款申请','订单号为:as201912131621023353289发出退款申请,退款原因:商家拒不发货退款理由:123','未读','2019-12-13 16:21:31',1),(45,2,'系统消息','您的商品OPPO A59m（3GB+32GB) 全网通 八核 金色通过审核!','已读','2019-12-08 12:41:56',1),(46,4,'系统消息','您的商品全新志高剃毛机毛球修剪器充电式去球器打毛衣服衣物吸除毛器刮毛通过审核!','已读','2019-12-08 14:35:57',1),(47,4,'系统消息','您的商品朋友送的，家里有一个了，现在转手卖，全新，支持自提，附近的可通过审核!','已读','2019-12-08 14:36:01',1),(58,1,'申请注入商家','用户编号为:22的用户,用户名为:白菜都让猪拱了申请注册为商家','已读','2019-12-08 15:56:57',22),(134,3,'确认收货','订单号为:as201912131627137095647已确认收货','未读','2019-12-13 16:27:20',1),(59,1,'申请注入商家','用户编号为:23的用户,用户名为:qqwE申请注册为商家','已读','2019-12-08 17:50:12',23),(85,2,'系统消息','您的商品魅族mx4高配32g能玩王者！2+16g移动联通双网4G手机通过审核!','未读','2019-12-11 08:34:29',1),(117,3,'系统提醒','添加了维权信息:123123','未读','2019-12-13 13:10:35',1),(115,1,'退款申请','订单号为:as201912131114232457510发出退款申请,退款原因:商家拒不发货退款理由:还不发货!!!!','未读','2019-12-13 12:59:45',1),(114,3,'系统提醒','订单号为:as201912131114232457510已发出退款申请,退款原因:商家拒不发货退款理由:还不发货!!!!','未读','2019-12-13 12:59:45',1),(110,3,'系统提醒','123123已成功购买您的商品《tf口红 16号黑管 tf15.tf80》,请您尽快发货!','未读','2019-12-13 09:16:43',1),(126,2,'系统提醒','订单号为:as201912131621023353289已发出退款申请,退款原因:商家拒不发货退款理由:123','未读','2019-12-13 16:21:31',1),(124,8,'系统消息','您的商品全新美的电热水壶通过审核!','未读','2019-12-13 14:01:59',1),(125,2,'系统提醒','sjks已成功购买您的商品《苹果11苹果x智能手机高清摄像畅玩游戏全新未拆封全》,请您尽快发货!','未读','2019-12-13 16:21:02',1),(122,8,'系统消息','您的商品AI智能蓝牙音箱mini语音声控控制小钢炮无线音箱户外跑步运已经进入反审阶段!','未读','2019-12-13 14:01:44',1),(121,8,'系统提醒','123123已成功购买您的商品《AI智能蓝牙音箱mini语音声控控制小钢炮无线音箱户外跑步运》,请您尽快发货!','未读','2019-12-13 13:57:53',1),(109,1,'退款申请','订单号为:as201912121627194374710发出退款申请,退款原因:商家拒不发货退款理由:123123','未读','2019-12-12 16:31:31',1),(116,2,'系统提醒','商家拒绝了你的退款申请,理由:请耐心等待','未读','2019-12-13 13:00:25',1),(71,2,'系统提醒','123123已成功购买您的商品《华为mate8 4+128 全网通》,请您尽快发货!','未读','2019-12-09 17:24:00',1),(70,12,'系统提醒','您的入驻商家申请已被管理员拒绝!','未读','2019-12-09 09:11:46',1),(123,8,'系统消息','您的商品AI智能蓝牙音箱mini语音声控控制小钢炮无线音箱户外跑步运通过审核!','未读','2019-12-13 14:01:54',1),(107,2,'系统提醒','平民潮牌小贩已成功购买您的商品《华为mate8 4+128 全网通》,请您尽快发货!','已读','2019-12-12 16:27:19',1),(106,1,'退款申请','订单号为:as201912120918348492720发出退款申请,退款原因:商家拒不发货退款理由:长时间未发货','未读','2019-12-12 09:18:52',1),(77,2,'系统消息','您的商品苹果手机原装耳机通过审核!','未读','2019-12-09 18:28:07',1),(105,3,'系统提醒','订单号为:as201912120918348492720已发出退款申请,退款原因:商家拒不发货退款理由:长时间未发货','未读','2019-12-12 09:18:52',1),(79,1,'退款申请','订单号为:as201912091724003126377发出退款申请,退款原因:商家拒不发货退款理由:123123','未读','2019-12-09 22:53:17',1),(80,2,'系统提醒','1111111已成功购买您的商品《苹果11苹果x智能手机高清摄像畅玩游戏全新未拆封全》,请您尽快发货!','未读','2019-12-10 10:55:11',1),(81,1,'申请注入商家','用户编号为:26的用户,用户名为:1111111申请注册为商家','已读','2019-12-10 10:57:19',26),(82,26,'系统消息','您的商品11通过审核!','已读','2019-12-10 10:59:10',1),(104,3,'系统提醒','123123已成功购买您的商品《阿玛尼唇釉新款口红烂番茄色405 204 400》,请您尽快发货!','未读','2019-12-12 09:18:34',1),(84,2,'系统提醒','1111111已成功购买您的商品《全新未激活iphone6s32g全网通4g》,请您尽快发货!','未读','2019-12-10 11:03:04',1),(89,2,'系统消息','您的商品全新未激活iphone6s32g全网通4g已经进入反审阶段!','未读','2019-12-11 15:41:29',1),(103,3,'系统消息','您的商品阿玛尼唇釉新款口红烂番茄色405 204 400通过审核!','未读','2019-12-12 09:17:54',1),(102,3,'系统消息','您的商品阿玛尼唇釉新款口红烂番茄色405 204 400已经进入反审阶段!','未读','2019-12-12 09:17:49',1),(92,2,'系统消息','您的商品全新未激活iphone6s32g全网通4g通过审核!','未读','2019-12-11 15:41:44',1),(93,2,'系统消息','您的商品华为mate8 4+128 全网通通过审核!','未读','2019-12-11 15:41:53',1),(94,2,'系统消息','您的商品苹果11苹果x智能手机高清摄像畅玩游戏全新未拆封全通过审核!','未读','2019-12-11 15:42:00',1),(95,3,'系统消息','您的商品迪奥999口红 哑光999 滋润999 全新正品带已经进入反审阶段!','未读','2019-12-11 15:42:25',1),(96,3,'系统消息','您的商品乳香美版，美版看好直接拍精油275元已经进入反审阶段!','未读','2019-12-11 15:42:38',1),(97,3,'系统消息','您的商品迪奥999口红 哑光999 滋润999 全新正品带通过审核!','未读','2019-12-11 15:42:48',1),(98,3,'系统消息','您的商品乳香美版，美版看好直接拍精油275元通过审核!','未读','2019-12-11 15:42:52',1),(100,3,'系统提醒','订单号为:as201912111544040597163已发出退款申请,退款原因:商家拒不发货退款理由:测试理由','未读','2019-12-11 15:47:07',1),(101,1,'退款申请','订单号为:as201912111544040597163发出退款申请,退款原因:商家拒不发货退款理由:测试理由','未读','2019-12-11 15:47:07',1);

/*Table structure for table `order` */

DROP TABLE IF EXISTS `order`;

CREATE TABLE `order` (
  `orderId` varchar(255) NOT NULL COMMENT '订单编号',
  `buyerId` int(11) NOT NULL COMMENT '买家编号',
  `ellerId` int(11) NOT NULL COMMENT '卖家编号',
  `amounts` double NOT NULL COMMENT '交易金额',
  `shippingAddress` int(11) NOT NULL COMMENT '订单收货地址',
  `orderTime` datetime NOT NULL COMMENT '订单时间',
  `orderState` varchar(10) NOT NULL DEFAULT '待发货' COMMENT '订单状态',
  `orderNumber` int(11) NOT NULL COMMENT '商品件数',
  `orderImg` varchar(255) NOT NULL COMMENT '商品图片',
  KEY `fk_order_user` (`buyerId`),
  KEY `fk_or_user` (`ellerId`),
  KEY `fk_order_add` (`shippingAddress`),
  CONSTRAINT `fk_or_user` FOREIGN KEY (`ellerId`) REFERENCES `user` (`userId`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_order_add` FOREIGN KEY (`shippingAddress`) REFERENCES `user_address` (`addressId`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_order_user` FOREIGN KEY (`buyerId`) REFERENCES `user` (`userId`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `order` */

insert  into `order`(`orderId`,`buyerId`,`ellerId`,`amounts`,`shippingAddress`,`orderTime`,`orderState`,`orderNumber`,`orderImg`) values ('as201912120918348492720',2,3,56,2,'2019-12-12 09:18:34','维权结束',1,'\\secondhand_shop\\upload\\201912071122433745492.jpg'),('as201912121627194374710',3,2,3988,5,'2019-12-12 16:27:19','维权结束',1,'\\secondhand_shop\\upload\\201912051635217663413.jpg'),('as201912130916438947969',2,3,72,1,'2019-12-13 09:16:43','维权结束',1,'\\secondhand_shop\\upload\\201912071127400994969.jpg'),('as201912131114232457510',2,3,140,2,'2019-12-13 11:14:23','申诉中',1,'\\secondhand_shop\\upload\\201912071134494366165.jpg'),('as201912131621023353289',28,2,18.8,8,'2019-12-13 16:21:02','维权结束',1,'\\secondhand_shop\\upload\\201912051632236013406.jpg'),('as201912131627134646224',2,2,2000,1,'2019-12-13 16:27:13','待发货',1,'\\secondhand_shop\\upload\\201912051700552435465.jpg'),('as201912131627137095647',2,3,268.8,1,'2019-12-13 16:27:13','已确认收货',1,'\\secondhand_shop\\upload\\201912071222249869739.jpg');

/*Table structure for table `picture` */

DROP TABLE IF EXISTS `picture`;

CREATE TABLE `picture` (
  `imgId` int(11) NOT NULL AUTO_INCREMENT COMMENT '图片编号',
  `imgAdd` varchar(255) NOT NULL COMMENT '图片地址',
  `comId` int(11) NOT NULL COMMENT '商品编号',
  PRIMARY KEY (`imgId`),
  KEY `picture_ibfk_1` (`comId`),
  CONSTRAINT `picture_ibfk_1` FOREIGN KEY (`comId`) REFERENCES `commodity` (`commodityId`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=149 DEFAULT CHARSET=utf8;

/*Data for the table `picture` */

insert  into `picture`(`imgId`,`imgAdd`,`comId`) values (8,'201912051632362958237.jpg',2),(9,'201912051632467511773.jpg',2),(10,'201912051633042417305.jpg',2),(11,'201912051633411131055.jpg',2),(12,'201912051635441073343.jpg',3),(13,'201912051635549921415.jpg',3),(14,'201912051636030424964.jpg',3),(15,'201912051636106667900.jpg',3),(16,'201912051636200871207.jpg',3),(17,'201912051644226141887.jpg',4),(18,'201912051644421529886.jpg',4),(19,'201912051645100819593.jpg',4),(20,'201912051647560646118.jpg',5),(21,'201912051650121215251.jpg',5),(22,'201912051650198452227.jpg',5),(23,'201912051650314827355.jpg',5),(24,'201912051655382194046.jpg',5),(25,'201912051700465883508.jpg',6),(26,'201912051702335362469.jpg',6),(27,'201912051702407292192.jpg',6),(28,'201912051702494112279.jpg',6),(29,'201912051702578086601.jpg',6),(30,'201912051706482333835.jpg',7),(31,'201912051706575914318.jpg',7),(32,'201912051707111166201.jpg',7),(33,'201912051707191731132.jpg',7),(34,'201912051709339523961.jpg',8),(35,'201912051709430437551.jpg',8),(36,'201912051709567061096.jpg',8),(37,'201912051710189769619.jpg',8),(38,'201912071123092342095.jpg',9),(39,'201912071123345228455.jpg',9),(40,'201912071127481476893.jpg',10),(41,'201912071128016344298.jpg',10),(42,'201912071128137167048.jpg',10),(43,'201912071129154999730.jpg',10),(44,'201912071129237789909.jpg',10),(45,'201912071135151745996.jpg',11),(46,'201912071135228325669.jpg',11),(47,'201912071135310419041.jpg',11),(48,'201912071137002426848.jpg',12),(49,'201912071139005427832.jpg',13),(50,'201912071217498375767.jpg',14),(51,'201912071217573229632.jpg',14),(52,'201912071218061503477.jpg',14),(53,'201912071220278341229.jpg',15),(54,'201912071220581247843.jpg',15),(55,'201912071221059514403.jpg',15),(56,'201912071222328706818.jpg',16),(57,'201912071222407756787.jpg',16),(58,'201912071222488856803.jpg',16),(59,'201912071222594585691.jpg',16),(70,'201912071231200733957.jpg',17),(71,'201912071231291026984.jpg',17),(72,'201912071231381676851.jpg',17),(73,'201912071231502376470.jpg',17),(74,'201912071231597549572.jpg',17),(75,'201912071238064059237.jpg',18),(76,'201912071238151684715.jpg',18),(77,'201912071238246221252.jpg',18),(78,'201912071238318039812.jpg',18),(79,'201912081220016144288.jpg',19),(80,'201912081220202181802.jpg',19),(81,'201912081220370943247.jpg',19),(82,'201912081220461802435.jpg',19),(83,'201912081220544941063.jpg',19),(84,'201912081223364945905.jpg',20),(85,'201912081223470842384.jpg',20),(86,'201912081223580862621.jpg',20),(87,'201912081224128347262.jpg',20),(88,'201912081224275543844.jpg',20),(89,'201912081240132492697.jpg',21),(90,'201912081240203718618.jpg',21),(91,'201912081240317732387.jpg',21),(92,'201912081240411293298.jpg',21),(93,'201912081240496113180.jpg',21),(94,'201912081240575831850.jpg',21),(106,'201912091823157195826.jpg',26),(107,'201912091823306955793.jpg',26),(108,'201912091823515983873.jpg',26),(109,'201912091824030921323.jpg',26),(110,'201912091824112336767.jpg',26),(111,'201912091824206498908.jpg',26),(112,'201912091824339832625.jpg',26),(113,'201912100906035126553.jpg',27),(114,'201912100906122573502.jpg',27),(115,'201912100906364015252.jpg',27),(116,'201912100906460514043.jpg',27),(117,'201912100906552509643.jpg',27),(118,'201912101058432087011.jpg',28),(119,'201912111538519766737.jpg',29),(120,'201912111539015479988.jpg',29),(121,'201912111539112355522.jpg',29),(122,'201912111539206368348.jpg',29),(123,'201912111539350543563.jpg',29),(124,'201912111539438767664.jpg',29),(125,'201912131323583713781.jpg',30),(126,'201912131324092387936.jpg',30),(127,'201912131324210683763.jpg',30),(128,'201912131327272583264.jpg',31),(129,'201912131327340117135.jpg',31),(130,'201912131327406443569.jpg',31),(131,'201912131327470491890.jpg',31),(132,'201912131327546845290.jpg',31),(133,'201912131328039071123.jpg',31),(134,'201912131328110457666.jpg',31),(135,'201912131328183833346.jpg',31),(136,'201912131330236507293.jpg',32),(137,'201912131330386873348.jpg',32),(138,'201912131330483058946.jpg',32),(139,'201912131331025131451.jpg',32),(140,'201912131331122981525.jpg',32),(141,'201912131331213708764.jpg',32),(142,'201912131334244093162.jpg',33),(143,'201912131334413386004.jpg',33),(144,'201912131334492352441.jpg',33),(145,'201912131334588154087.jpg',33),(146,'201912131335065601250.jpg',33),(147,'201912131335158152420.jpg',33),(148,'201912131624191289339.jpg',34);

/*Table structure for table `tuikuan` */

DROP TABLE IF EXISTS `tuikuan`;

CREATE TABLE `tuikuan` (
  `weiqId` int(11) NOT NULL AUTO_INCREMENT COMMENT '编号',
  `ordeId` varchar(255) NOT NULL COMMENT '订单编号',
  `userId` int(11) NOT NULL COMMENT '用户编号',
  `comuserId` int(11) NOT NULL COMMENT '商家编号',
  `cause` varchar(255) NOT NULL COMMENT '原因',
  `content` varchar(255) NOT NULL COMMENT '内容',
  `state` varchar(255) NOT NULL COMMENT '状态',
  `time` datetime NOT NULL COMMENT '时间',
  PRIMARY KEY (`weiqId`),
  KEY `fk_tui_user` (`userId`),
  KEY `fk_tui_userId` (`comuserId`),
  CONSTRAINT `fk_tui_user` FOREIGN KEY (`userId`) REFERENCES `user` (`userId`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_tui_userId` FOREIGN KEY (`comuserId`) REFERENCES `user` (`userId`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8;

/*Data for the table `tuikuan` */

insert  into `tuikuan`(`weiqId`,`ordeId`,`userId`,`comuserId`,`cause`,`content`,`state`,`time`) values (1,'as201912120918348492720',2,3,'商家拒不发货','长时间未发货','退款中','2019-12-12 10:02:53'),(2,'as201912120918348492720',3,2,'拒绝退款','一旦售出,拒绝退款','拒绝退款','2019-12-12 14:32:39'),(5,'as201912120918348492720',2,3,'添加维权信息','123123','申诉中','2019-12-12 15:57:47'),(6,'as201912120918348492720',3,2,'拒绝退款','123123','拒绝退款','2019-12-12 15:57:58'),(7,'as201912120918348492720',2,3,'添加维权信息','123123','申诉中','2019-12-12 15:59:23'),(9,'as201912120918348492720',3,2,'同意退款','gun','同意退款','2019-12-12 16:20:35'),(10,'as201912121627194374710',3,2,'商家拒不发货','123123','退款中','2019-12-12 16:31:31'),(11,'as201912121627194374710',2,3,'拒绝退款','123123','拒绝退款','2019-12-12 16:32:25'),(12,'as201912121627194374710',3,2,'添加维权信息','123123','申诉中','2019-12-12 16:32:40'),(13,'as201912121627194374710',2,3,'同意退款','','同意退款','2019-12-12 16:32:47'),(14,'as201912130916438947969',2,3,'商家拒不发货','测试','退款中','2019-12-13 10:30:24'),(15,'as201912130916438947969',3,2,'拒绝退款','123123','拒绝退款','2019-12-13 10:31:47'),(16,'as201912130916438947969',2,3,'添加维权信息','123123','申诉中','2019-12-13 11:58:47'),(17,'as201912130916438947969',3,2,'拒绝退款给买家','','拒绝退款给买家','2019-12-13 12:40:47'),(18,'as201912131114232457510',2,3,'商家拒不发货','还不发货!!!!','退款中','2019-12-13 12:59:45'),(19,'as201912131114232457510',3,2,'拒绝退款','请耐心等待','拒绝退款','2019-12-13 13:00:25'),(20,'as201912131114232457510',2,3,'添加维权信息','123123','申诉中','2019-12-13 13:10:35'),(21,'as201912131621023353289',28,2,'商家拒不发货','123','退款中','2019-12-13 16:21:31'),(22,'as201912131621023353289',2,28,'同意退款','123123','同意退款','2019-12-13 16:22:19');

/*Table structure for table `user` */

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `userId` int(10) NOT NULL AUTO_INCREMENT COMMENT '用户编号',
  `userName` varchar(255) NOT NULL COMMENT '用户名',
  `userPwd` varchar(255) NOT NULL COMMENT '用户密码',
  `sex` varchar(10) NOT NULL COMMENT '性别',
  `tradePwd` varchar(255) NOT NULL COMMENT '交易密码',
  `userPhone` varchar(25) DEFAULT NULL COMMENT '手机号',
  `shippingAddress` int(10) DEFAULT NULL COMMENT '地址',
  `userStatus` int(10) NOT NULL DEFAULT '1' COMMENT '用户状态',
  `userGrade` int(10) NOT NULL DEFAULT '3' COMMENT '用户等级',
  `registrationTime` date NOT NULL COMMENT '注册时间',
  `userMoney` double NOT NULL DEFAULT '0' COMMENT '余额',
  PRIMARY KEY (`userId`),
  KEY `fk_user_status` (`userStatus`),
  KEY `fk_user_grade` (`userGrade`),
  CONSTRAINT `fk_user_grade` FOREIGN KEY (`userGrade`) REFERENCES `user_grade` (`gradeId`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_user_status` FOREIGN KEY (`userStatus`) REFERENCES `user_status` (`statusId`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8;

/*Data for the table `user` */

insert  into `user`(`userId`,`userName`,`userPwd`,`sex`,`tradePwd`,`userPhone`,`shippingAddress`,`userStatus`,`userGrade`,`registrationTime`,`userMoney`) values (1,'admin','4297f44b13955235245b2497399d7a93','男','4297f44b13955235245b2497399d7a93','123123123',NULL,1,1,'2019-11-14',0),(2,'123123','4297f44b13955235245b2497399d7a93','女','4297f44b13955235245b2497399d7a93','15679098685',0,1,2,'2019-11-14',12819),(3,'平民潮牌小贩','4297f44b13955235245b2497399d7a93','女','4297f44b13955235245b2497399d7a93','15679098685',0,1,2,'2019-11-14',87417.8),(4,'黛西','4297f44b13955235245b2497399d7a93','女','312fd2f3cabafc9417c35fd00efdaa5d','15679098685',0,1,2,'2019-11-14',0),(5,'呆瓜','4297f44b13955235245b2497399d7a93','女','','15679098685',NULL,1,3,'2019-11-14',0),(6,'测试123','4297f44b13955235245b2497399d7a93','女','4297f44b13955235245b2497399d7a93','15679098685',0,1,1,'2019-11-14',0),(7,'clown','4297f44b13955235245b2497399d7a93','女','4297f44b13955235245b2497399d7a93','17689092929',0,1,3,'2019-11-20',121216.2),(8,'测试9','4297f44b13955235245b2497399d7a93','男','4297f44b13955235245b2497399d7a93','17758861231',NULL,1,2,'2019-11-20',0),(9,'文熙','4297f44b13955235245b2497399d7a93','女','f5bb0c8de146c67b44babbf4e6584cc0','17787908855',0,1,3,'2019-11-14',0),(11,'小胖11','4297f44b13955235245b2497399d7a93','女','','15679098685',NULL,1,3,'2019-11-15',0),(12,'1234','4297f44b13955235245b2497399d7a93','女','4297f44b13955235245b2497399d7a93','15679098685',0,1,3,'2019-11-15',0),(13,'方旭123','4297f44b13955235245b2497399d7a93','女','','15679098685',NULL,1,3,'2019-11-15',0),(14,'家居商城','0192023a7bbd73250516f069df18b500','女','','13755709848',NULL,1,3,'2019-11-15',0),(15,'家居商城2','0192023a7bbd73250516f069df18b500','女','','13755709848',NULL,1,3,'2019-11-15',0),(16,'runl','efe6398127928f1b2e9ef3207fb82663','女','','13755709848',NULL,1,3,'2019-11-15',0),(17,'潮牌小屋','4297f44b13955235245b2497399d7a93','女','4297f44b13955235245b2497399d7a93','17689092929',NULL,1,3,'2019-11-20',0),(18,'测试12','4297f44b13955235245b2497399d7a93','女','4297f44b13955235245b2497399d7a93','17689092929',NULL,1,3,'2019-11-20',0),(19,'测试','4297f44b13955235245b2497399d7a93','男','4297f44b13955235245b2497399d7a93','15679098685',NULL,1,3,'2019-11-20',0),(20,'kun','4297f44b13955235245b2497399d7a93','男','4297f44b13955235245b2497399d7a93','17787908685',NULL,1,3,'2019-11-20',0),(21,'等级测试','4297f44b13955235245b2497399d7a93','男','4297f44b13955235245b2497399d7a93','15679098687',NULL,1,3,'2019-11-20',0),(22,'白菜都让猪拱了','4297f44b13955235245b2497399d7a93','女','4297f44b13955235245b2497399d7a93','17787908584',NULL,1,2,'2019-12-08',0),(23,'qqwE','e10adc3949ba59abbe56e057f20f883e','男','e10adc3949ba59abbe56e057f20f883e','13811111111',NULL,1,2,'2019-12-08',0),(24,'测试3','4297f44b13955235245b2497399d7a93','男','4297f44b13955235245b2497399d7a93','17787905656',NULL,1,2,'2019-12-09',0),(25,'测试11','4297f44b13955235245b2497399d7a93','男','4297f44b13955235245b2497399d7a93','18824256518',NULL,1,3,'2019-12-10',0),(26,'1111111','4297f44b13955235245b2497399d7a93','女','3ed80171b1f4ab825f2038fc203c887c','17689092929',0,1,2,'2019-12-10',9283.2),(27,'11111','4297f44b13955235245b2497399d7a93','男','4297f44b13955235245b2497399d7a93','17728988787',NULL,1,3,'2019-12-10',0),(28,'sjks','e10adc3949ba59abbe56e057f20f883e','男','e10adc3949ba59abbe56e057f20f883e','17689092929',0,2,2,'2019-12-13',1000);

/*Table structure for table `user_address` */

DROP TABLE IF EXISTS `user_address`;

CREATE TABLE `user_address` (
  `addressId` int(11) NOT NULL AUTO_INCREMENT COMMENT '地址编号',
  `addressPlace` varchar(255) NOT NULL COMMENT '所在地区',
  `userId` int(11) NOT NULL COMMENT '用户编号',
  `phone` varchar(255) NOT NULL COMMENT '手机号码',
  `detailedAddress` varchar(255) NOT NULL COMMENT '详细地址',
  `isDefault` varchar(10) DEFAULT 'on' COMMENT '是否为默认地址',
  `consignee` varchar(255) NOT NULL COMMENT '收货人姓名',
  PRIMARY KEY (`addressId`),
  KEY `fk_add_user` (`userId`),
  CONSTRAINT `fk_add_user` FOREIGN KEY (`userId`) REFERENCES `user` (`userId`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8;

/*Data for the table `user_address` */

insert  into `user_address`(`addressId`,`addressPlace`,`userId`,`phone`,`detailedAddress`,`isDefault`,`consignee`) values (1,'上海市辖区黄浦区',2,'17689092929','测试地址','是','123123'),(2,'上海县崇明县',2,'17689092929','测试地址2','否','123123'),(3,'江西新余市渝水区',2,'17689092929','江西科技中等专业学校','否','zzh'),(5,'上海市辖区黄浦区',3,'17689092929','三生三世','是','潮牌小凡'),(6,'北京市辖区东城区',7,'17689092929','测试地址','否','clown'),(7,'上海县崇明县',9,'18824256518','测试地址','否','文熙'),(8,'北京市辖区东城区',28,'17689092929','123123','否','123123');

/*Table structure for table `user_grade` */

DROP TABLE IF EXISTS `user_grade`;

CREATE TABLE `user_grade` (
  `gradeId` int(10) NOT NULL AUTO_INCREMENT COMMENT '等级编号',
  `gradeName` varchar(255) NOT NULL COMMENT '等级名称',
  `explain` varchar(255) NOT NULL COMMENT '等级说明',
  PRIMARY KEY (`gradeId`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

/*Data for the table `user_grade` */

insert  into `user_grade`(`gradeId`,`gradeName`,`explain`) values (1,'超级管理员','后台增删改操作,审核商品,维权处理'),(2,'商家','登陆前台,发布商品,上架商品,下架商品'),(3,'普通会员','购买商品');

/*Table structure for table `user_status` */

DROP TABLE IF EXISTS `user_status`;

CREATE TABLE `user_status` (
  `statusId` int(10) NOT NULL AUTO_INCREMENT COMMENT '状态编号',
  `statusName` varchar(255) NOT NULL COMMENT '状态名称',
  PRIMARY KEY (`statusId`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

/*Data for the table `user_status` */

insert  into `user_status`(`statusId`,`statusName`) values (1,'正常'),(2,'封禁');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
